>>> s1=set([1,2,3])
>>> s1
{1, 2, 3}
>>> s2=set("hello")
>>> s2
{'e', 'h', 'o', 'l'} #중복 허용X, 순서X

#인덱싱으로 접근하려면?
>>> s1=set([1,2,3])
>>> l1=list(s1) #리스트로 변환
>>> l1
[1, 2, 3]
>>> l1[0]
1
>>> t1=tuple(s1) #튜플로 변환
>>> t1
(1, 2, 3)
>>> t1[0]
1

>>> s1=set([1,2,3,4,5,6])
>>> s2=set([4,5,6,7,8,9])
#교집합('&'기호나 intersection()함수 사용)
>>> s1&s2
{4, 5, 6}
>>> s1.intersection(s2)
{4, 5, 6}
>>> s2.intersection(s1)
{4, 5, 6}
#합집합('|'기호나 union()함수 사용)
>>> s1|s2
{1, 2, 3, 4, 5, 6, 7, 8, 9}
>>> s1.union(s2)
{1, 2, 3, 4, 5, 6, 7, 8, 9}
>>> s2.union(s1)
{1, 2, 3, 4, 5, 6, 7, 8, 9}
#차집합('-'기호나 difference()함수 사용)
>>> s1-s2
{1, 2, 3}
>>> s2-s1
{8, 9, 7}
>>> s1.difference(s2)
{1, 2, 3}
>>> s2.difference(s1)
{8, 9, 7}

>>> import numpy as np
>>> s1={*np.random.randint(-100,100,100)}
>>> s2={*np.random.randint(-100,100,100)}

# ﻿add() 이미 만들어진 set자료형에 값 추가
>>> s1=set([1,2,3])
>>> s1.add(4)
>>> s1
{1, 2, 3, 4}
#﻿ update() 여러 개의 값을 한꺼번에 추가
>>> s1=set([1,2,3])
>>> s1.update([4,5,6])
>>> s1
{1, 2, 3, 4, 5, 6}
#﻿ remove() 특정 값을 제거
>>> s1=set([1,2,3])
>>> s1.remove(2)
>>> s1
{1, 3}